lib/soap-templates/GetCategories.hbs

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:job="http://jobboard.webservice.madgex.co.uk">
   <soap:Header/>
   <soap:Body>
      <job:GetCategories/>
   </soap:Body>
</soap:Envelope>